%% ОСНОВНЫЕ ПАРАМЕТРЫ СРЕДЫ
rho = 1000; % плотность воды

%% ОСНОВНЫЕ ПАРАМЕТРЫ ПА [Table 5.1]
m = 11.5; % масса [кг]
r_b_b = [0; 0; 0]; % вектор центра плавучести [м]
r_g_b = [0; 0; 0.02]; % вектор центра масс [м]
B = 114.8; % плавучесть [Н]
W = 114.8; % сила тяжести [Н]
I0 = diag([0.16, 0.16, 0.16]); % тензор инерции [кг * м^2]

%% ПРИСОЕДИНЕННЫЕ МАССЫ [Table 5.2]
M_A = -diag([-5.5, -12.7, -14.57, -0.12, -0.12, -0.12]);

%% ДЕМПФИРОВАНИЕ [Table 5.3]
D_LIN = -diag([-4.03, -6.22, -5.18, -0.07, -0.07, -0.07]);
D_QUAD = -diag([-18.18, -21.66, -36.99, -1.55, -1.55, -1.55]);



%% ОСНОВНЫЕ ПАРАМЕТРЫ ГРУЗА
r_c = 0.15;
m_c = 3.0; % масса [кг]
r_b_b_c = [0; 0; 0]; % вектор центра плавучести [м]
r_g_b_c = [0; 0; 0]; % вектор центра масс [м]
B_c = 0; % плавучесть [Н]
W_c = m * 9.81; % сила тяжести [Н]
I0_c = diag([(2/5)*m_c*r_c^2, (2/5)*m_c*r_c^2, (2/5)*m_c*r_c^2]); % тензор инерции сферы [кг * м^2]

%% ПРИСОЕДИНЕННЫЕ МАССЫ ГРУЗА
M_A_c = -diag([-(2/3)*pi*rho*r_c^3, -(2/3)*pi*rho*r_c^3, -(2/3)*pi*rho*r_c^3, 0, 0, 0]);

%% ДЕМПФИРОВАНИЕ [УТОЧНИТЬ]
%D_LIN_c = -diag([0, 0, 0, 0, 0, 0]);
%D_QUAD_c = -diag([0, 0, 0, 0, 0, 0]);
D_LIN_c = -diag([-4.03, -6.22, -5.18, -0.07, -0.07, -0.07]);
D_QUAD_c = -diag([-18.18, -21.66, -36.99, -1.55, -1.55, -1.55]);